---
title: "lab1"
format: html
editor: visual
---

## Цель работы

Получить сведения о системе

## Исходные данные

1\. Программное обеспечение astralinux

2\. Rstudio

## План

1.  Получить сведения версию ядра
2.  Получить полные сведения о ядре
3.  Используемый дистрибутив
4.  Получить модель процессора
5.  Получение информации о скрытых файлах

## Шаги:

1.  Получаем версию ядра при помощи команды uname -r

```{bash}
uname -r
```

![](images/image-893148231.png)

2.  Получаем полные сведения о ядре при помощи команды uname -a

```{bash}
uname -a
```

![](images/image-912835669.png)

3.  Используей дистрибутив получаем при помощи команды lsb_release -a

```{bash}
lsb_release -a
```

![](images/image-805631590.png)

4.  Полную информацию получаем при помощи команды cat /proc/cpuinfo

```{bash}
cat /proc/cpuinfo 
```

![](images/image-1652744137.png)

![](images/image-1176307496.png)

5.  Модель процессора получаем при помощи команды cat /proc/cpuinfo \| grep "model name"

```{bash}
cat /proc/cpuinfo | grep "model name"
```

![](images/image-821332547.png)

6.  Все скрытые файлы смотрим при помощи команды ls -a

```{bash}
ls -a
```

![](images/image-629812899.png)

## Оценка результата

В результате были получены сведения об используемой системе

## Вывод

Таким образом, я научился получать сведения о системе astralinux
